import styles from "../HomePage.module.css";

export const LikeProgrammingSection = () => {
  return (
    <section>
      <h2>Программирование, как стиль жизни.</h2>
      <p className={styles.text}>
        Мое увлечение программированием началось в 10 классе. C миром кода я
        познакомился на уроках информатики, и эта встреча изменила мою жизнь
        навсегда. Изначально это был язык программирования C++ и
        программирование контроллеров. Уже в школе я мечтал стать программистом
        и создавать вещи, которые будут приносить пользу людям.
      </p>
      <p className={styles.text}>
        В 2020 году моя мечта сбылась - я устроился на свою первую работу. Мое
        первое рабочее место было настоящим вызовом. Я занимался
        смарт-контрактами, бэкендом и фронтендом. Каждый день был полон новых
        задач и проблем, и мне это нравилось. Именно тут я понял, что работа в
        IT требует творчества и логического мышления.
      </p>
      <p className={styles.text}>
        Программирование дало мне не только карьерные возможности. Оно научило
        меня самодисциплине. Без организации своего времени и постоянного
        обучения, как мне кажется, невозможно оставаться в этой индустрии. Я
        научился управлять временем, ставить приоритеты и каждый день узнавать
        что-то новое.
      </p>
      <p className={styles.text}>
        Программирование стало неотъемлемой частью моей жизни. Это моя страсть,
        способ выражения себя и реализации идей. Я вижу, как технологии меняют
        мир, и я хочу быть частью этих перемен. Каждый проект, в котором я
        учавствую, приносит мне удовлетворение и чувство достижения.
      </p>
    </section>
  );
};
